In [18]:
import numpy as np
import pandas as pd
import seaborn as sns

In [4]:
# What are vectorized operations
a = np.array([1,2,3,4])
a * 4

array([ 4,  8, 12, 16])

In [17]:
# problem in vectorized opertions in vanilla python
# Eidhar error ess liye aya kio eidhar ek none missing value thy to none simple python code string nhy samjhta ess liye error de diya
s = ['cat','mat',None,'rat']

[i.startswith('c') for i in s]

AttributeError: 'NoneType' object has no attribute 'startswith'

In [11]:
# How pandas solves this issue?

s = pd.Series(['cat','mat',None,'rat'])

# string accessor
s.str.startswith('c')
s.str.endswith('c')

# fast and optimized

0     True
1    False
2     None
3    False
dtype: object

In [20]:
# import titanic dataset
df = pd.read_csv('C:\\Users\\Lenovo\\Downloads\\titanic.csv')
df.head()

# this is built_in dataset in seaborn library 
# sns.load_dataset('titanic').head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
# Common Functions
# lower/upper/capitalize/title
df['Name'].str.upper()
df['Name'].str.capitalize()
df['Name'].str.title()
# len
df['Name'][df['Name'].str.len() == 82].values[0]
# strip
"                   nitish                              ".strip()
df['Name'].str.strip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [18]:
# common functions used for str operations
# upper/lower/capitalize/title
df['Name'].str.upper()
df['Name'].str.lower()
df['Name'].str.capitalize()
df['Name'].str.title()
df['Name'].str.swapcase()

0                                bRAUND, mR. oWEN hARRIS
1      cUMINGS, mRS. jOHN bRADLEY (fLORENCE bRIGGS tH...
2                                 hEIKKINEN, mISS. lAINA
3           fUTRELLE, mRS. jACQUES hEATH (lILY mAY pEEL)
4                               aLLEN, mR. wILLIAM hENRY
                             ...
886                                mONTVILA, rEV. jUOZAS
887                         gRAHAM, mISS. mARGARET eDITH
888             jOHNSTON, mISS. cATHERINE hELEN "cARRIE"
889                                bEHR, mR. kARL hOWELL
890                                  dOOLEY, mR. pATRICK
Name: Name, Length: 891, dtype: object

In [30]:
# to find of lenght of highest name from name column
# df['Name'].str.len().sort_values(ascending = False)    First find this then move to which name contains 82 worlds
df['Name'][df['Name'].str.len() == 82]

307    Penasco y Castellana, Mrs. Victor de Satode (M...
Name: Name, dtype: object

In [27]:
# strip function to remove extra spaces from dataset columns or rows
data = "                  Dta        "
data.strip()         # Remove both side extra spaces
data.lstrip()
data.rstrip()

'                  Dta'

In [32]:
# separate name and store it into new columns in dataset
df['Sir_name'] = df['Name'].str.split(',').str.get(0)
df.head()

df['new_name'] = df['Name'].str.split(',').str.get(1)
df.sample(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sir_name,new_name
637,638,0,2,"Collyer, Mr. Harvey",male,31.0,1,1,C.A. 31921,26.2500,NaN,S,Collyer,Mr. Harvey
359,360,1,3,"Mockler, Miss. Helen Mary ""Ellie""",female,NaN,0,0,330980,7.8792,NaN,Q,Mockler,"Miss. Helen Mary ""Ellie"""
681,682,1,1,"Hassab, Mr. Hammad",male,27.0,0,0,PC 17572,76.7292,D49,C,Hassab,Mr. Hammad
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.5500,NaN,S,Sage,Mr. Frederick

In [34]:
# From above question i split names into three part like Sir_name, Title, and Own_name now i want to create new column of title_name and Own_name

df[['Title_name', 'Own_name']]= df['Name'].str.split(',').str.get(1).str.strip().str.split('.', n = 1, expand = True)
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sir_name,new_name,Title_name,Own_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris,Mr,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer),Mrs,John Bradley (Florence Briggs Thayer)

In [47]:
# Ess mein Miss , Ms, aur Mlle same words hain mein en ko ek karna chahta ho
df['Title_name'].value_counts()

df['Title_name'] = df['Title_name'].str.replace('Ms.' , 'Miss.')
df['Title_name'] = df['Title_name'].str.replace('Mlle.' , 'Miss.')

In [52]:
df['Title_name'].value_counts()

Title_name
Mr.          517
Miss.        185
Mrs.         125
Master.       40
Dr.            7
Rev.           6
Major.         2
Col.           2
Don.           1
Mme.           1
Lady.          1
Sir.           1
Capt.          1
the            1
Jonkheer.      1
Name: count, dtype: int64

In [6]:
# Hamein name dataset column mein sy wo name find karne hain jo A sy start howe hain
df[df['Own_name'].str.startswith('A')].sample(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title_name,Own_name
520,521,1,1,"Perreault, Miss. Anne",female,30.0,0,0,12749,93.5,B73,S,Miss.,Anne
781,782,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.0,1,0,17474,57.0,B20,S,Mrs.,Albert Adrian (Vera Gillespie)

In [7]:
# contain() : function to find or search you want from string
# I want to find john name from Own_name column of dataset. Here case = False means you find value in large words or capital on both

df[df['Own_name'].str.contains('John' , case = False)].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title_name,Own_name
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs.,John Bradley (Florence Briggs Thayer)
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.0000,NaN,S,Mrs.,William John Robert (Dorothy Ann Wonnacott)

In [8]:
# Find those names those starts and ends with vowel

df[df['Own_name'].str.contains('^[aeiouAEIOU].+[aeiouAEIOU]$')].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title_name,Own_name
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q,Master.,Eugene
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.000,NaN,S,Miss.,Augusta Maria
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.000,B28,NaN,Miss.,Amelie

In [9]:
# find those names who start and ends with consunant 
df[df['Own_name'].str.contains('^[^aeiouAEIOU].+[^aeiouAEIOU]$')].head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title_name,Own_name
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs.,John Bradley (Florence Briggs Thayer)
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs.,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr.,William Henry
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Mr.,James

In [66]:
# I can also use slicing on dataset
df['Name'].str[:5]

0      Braun
1      Cumin
2      Heikk
3      Futre
4      Allen
       ...
886    Montv
887    Graha
888    Johns
889    Behr,
890    Doole
Name: Name, Length: 891, dtype: object

In [69]:
df['Name'].str[-1::2]

0      s
1      )
2      a
3      )
4      y
      ..
886    s
887    h
888    "
889    l
890    k
Name: Name, Length: 891, dtype: object

In [2]:
import pandas as pd

data = pd.Series(["machine learning", "Deep Learning", "artificial intelligence", None])

print(data.str.upper())     # Convert to uppercase
print(data.str.lower())     # Convert to lowercase
print(data.str.capitalize())  # Capitalize the first letter
print(data.str.title())     # Capitalize first letter of each word
print(data.str.swapcase())  # Swap upper and lower case

0           MACHINE LEARNING
1              DEEP LEARNING
2    ARTIFICIAL INTELLIGENCE
3                       None
dtype: object
0           machine learning
1              deep learning
2    artificial intelligence
3                       None
dtype: object
0           Machine learning
1              Deep learning
2    Artificial intelligence
3                       None
dtype: object
0           Machine Learning
1              Deep Learning
2    Artificial Intelligence
3                       None
dtype: object
0           MACHINE LEARNING
1              dEEP lEARNING
2    ARTIFICIAL INTELLIGENCE
3                       None
dtype: object

In [3]:
print(data.str.contains("learning", case=False, na=False))  # Case insensitive check
print(data.str.startswith("Deep"))
print(data.str.endswith("intelligence"))

0     True
1     True
2    False
3    False
dtype: bool
0    False
1     True
2    False
3     None
dtype: object
0    False
1    False
2     True
3     None
dtype: object

In [75]:
reviews = pd.Series([
    "  This product is AMAZING!   ",
    "Worst experience ever...  ",
    "Absolutely fantastic!! ",
    None
])

cleaned_reviews = reviews.str.strip().str.lower().str.replace(r'[^\w\s]', '', regex=True)
print(cleaned_reviews)

0    this product is amazing
1      worst experience ever
2       absolutely fantastic
3                       None
dtype: object

In [1]:
import datetime
today = datetime.datetime.today()
print(today)

2025-09-04 00:02:31.887314